// © Copyright 2012-2013, 2015-2016 HP Development Company, L.P.

// Task name & description
HSDTaskName = "Välityspalvelimen asetukset";
HSDTaskDescription = "Tulostimesta voidaan muodostaa internet-yhteys. Jos internet-yhteyden muodostamiseen käytetään välityspalvelinta, määritä asetukset alle.";
TaskDescriptionInAssistantMode = "Jotta voit muodostaa yhteyden HP:n verkkopalveluihin, tulostimesi täytyy olla yhteydessä Internetiin. Jos käytät välityspalvelinta Internet-yhteyden muodostamiseen, anna asetukset alle.\n\nJos et tiedä välityspalvelimen asetuksia, katso asetukset Verkkoasetukset-paneelista tai ota yhteyttä järjestelmänvalvojaan.";

// Radio buttons matrix
HSDProxyServerNotRequiredTitle = "Välityspalvelinta ei vaadita internet-yhteyden muodostamiseen";
HSDAutomaticProxySettingsTitle = "Automaattinen (laite tunnistaa asetukset automaattisesti)";
HSDCustomProxySettingsTitle = "Mukautettu välityspalvelinkokoonpano:";
HSDSystemProxySettingsTitle = "Kopioi järjestelmäasetukset";

// Proxy server settings
HSDProxyServerTitle = "Välityspalvelin:";
ProxyPortTitle = "Välityspalvelimen portti:";

// Authentication
HSDRequiresAuthenticationButton = "Välityspalvelin vaatii todennuksen";
HSDUserNameTitle = "Käyttäjänimi:";
HSDPasswordTitle = "Salasana:";

HSDApplyNowButtonTitle = "Käytä nyt";

// progress titles
UpdateInformationProcessTitle = "Päivitetään tietoja...";

// alerts
EmptyProxyServerOrPortErrorText = "Sekä välityspalvelin että välityspalvelimen portti on määritettävä.";

EmptyUserNameOrPasswordErrorText = "Välityspalvelimen todennusta varten on määritettävä sekä käyttäjänimi että salasana.";

IncorrectProxyServerNameFormatErrorText = "Välipalvelimen nimen asetus ei onnistunut. Tarkasta, onko formaatti voimassa.";

HSDUserNameTooLargeErrorText = "Käyttäjänimi on liian pitkä. Laite tukee käyttäjänimeä, jossa on enintään %d merkkiä.";
